Revit 2027 API
AnalyticalElement.IsSingleCurve Method
 Indicates if the Analytical Element can be expressed as a single curve.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSingleCurve()
Public Function IsSingleCurve As Boolean
public:
bool IsSingleCurve()
member IsSingleCurve : unit -> bool
Return Value
Boolean
 True if Analytical Element can be expressed as a single curve, false otherwise.
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace